app/controllers/posts_controller.rb

INSERT INTO "posts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "asdasd"], ["user_id", 2], ["created_at", "2016-11-16 21:50:23.897561"], ["updated_at", "2016-11-16 21:50:23.897561"]]
---
    def create
        @post = Post.new(post_params)
        @post.user_id = current_user.id
        respond_to do |f|
            if (@post.save)